Enums/ИА_СпособыВыводаФИОДляОргсхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_СпособыВыводаФИОДляОргсхемы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФИОПолное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФИОСокращено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФИОБезОтчестваПолностью</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ИА_ОргСхема_СерверПовторИсп/Ext/Module.bsl
Функция Константа_ПолучитьШрифтПодписиСотрудника() Экспорт
    шр = Константы.ИА_ШрифтПодписиСотрудника.Получить().Получить();
    если шр = Неопределено ТОгда
        шр = Новый Шрифт("Times New Roman",10 , истина, Истина);
    КонецЕсли;
    Возврат шр;	
КонецФункции

Функция РазложитьСтрокуВМассивПодстрок1(Знач Строка, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено) Экспорт
    
    Результат = Новый Массив;
    
    // для обеспечения обратной совместимости
    Если ПропускатьПустыеСтроки = Неопределено Тогда
        ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
        Если ПустаяСтрока(Строка) Тогда 
            Если Разделитель = " " Тогда
                Результат.Добавить("");
            КонецЕсли;
            Возврат Результат;
        КонецЕсли;
    КонецЕсли;
    //
    
    Позиция = Найти(Строка, Разделитель);
    Пока Позиция > 0 Цикл
        Подстрока = Лев(Строка, Позиция - 1);
        Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
            Результат.Добавить(Подстрока);
        КонецЕсли;
        Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
        Позиция = Найти(Строка, Разделитель);
    КонецЦикла;
    
    Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
        Результат.Добавить(Строка);
    КонецЕсли;
    
    Возврат Результат;
    
КонецФункции

Функция ПолучитьИнициалыПоСтроке(ФИО) Экспорт
    
    //ИА_ 20160225 ПредставлениеФИО = Константы.ИА_СпособВыводаФИОДляОргсехмы.Получить();
	ПредставлениеФИО = ИА_БФСПИ.Константа_Получить("ИА_СпособВыводаФИОДляОргсехмы");
    Фамилия  = "";
    Имя      = "";
    Отчество = "";
    
    Результат = ФИО;
    Пока Найти(Результат, "  ") > 0 Цикл
        Результат = СтрЗаменить(Результат, "  ", " ");
    КонецЦикла;
    Результат = СокрЛП(Результат) + " ";
    ПозицияПробела = Найти(Результат, " ");
    Фамилия = Лев(Результат, ПозицияПробела - 1);
    
    Результат = Сред(Результат, ПозицияПробела + 1);
    ПозицияПробела = Найти(Результат, " ");
    Если ПозицияПробела > 0 Тогда
        Имя = " " + Лев(Результат, ПозицияПробела - 1);
    КонецЕсли;
    
    
    Результат = СокрЛП(Результат); 
    ДлинаИмени  = СтрДлина(Имя);
    Отчество    = Сред(СокрЛП(Результат), ДлинаИмени);
    
    Если      ПредставлениеФИО = Перечисления.ИА_СпособыВыводаФИОДляОргсхемы.ФИОБезОтчестваПолностью Тогда          
         Результат = Фамилия + Имя;         
    ИначеЕсли ПредставлениеФИО = Перечисления.ИА_СпособыВыводаФИОДляОргсхемы.ФИОПолное Тогда
         Результат = Фамилия + Имя + Отчество;
    ИначеЕсли ПредставлениеФИО = Перечисления.ИА_СпособыВыводаФИОДляОргсхемы.ФИОСокращено Тогда
        Результат = Фамилия + Лев(Имя,2)+"."+ ?(СокрЛП(Отчество) = "","",Лев(Отчество,2))+"."; 
  	Иначе
        Результат = Фамилия + Имя;  
    КонецЕсли; 
    
    
    Возврат  Результат;		
    
КонецФункции
